In [1]:
import pandas as pd

In [2]:
df_top_yout = pd.read_csv(r".\topyoutube.csv")

In [3]:
df_top_yout.head()

          Artist Total Views  100M     Avg
0            BTS    27,947.9  63.0   7.370
1      Bad Bunny    27,573.4  66.0  14.555
2  Justin Bieber    27,399.7  37.0   3.986
3     Ed Sheeran    26,894.0  39.0   4.609
4   Taylor Swift    24,350.0  38.0   5.716

In [4]:
df_top_yout['Total Views'] = df_top_yout['Total Views'].str.replace(',','')

In [5]:
df_top_yout['Total Views'] = pd.to_numeric(df_top_yout['Total Views'])

In [6]:
df_top_yout['Total Views'] = df_top_yout['Total Views']*10**8

In [7]:
df_top_yout.fillna('Não Informado', inplace=True)

C:\Users\veron\AppData\Local\Temp\ipykernel_14440\3338499852.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Não Informado' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df_top_yout.fillna('Não Informado', inplace=True)

In [8]:
df_top_yout['Avg'] = df_top_yout['Avg'].map('{:,.2f}'.format)

In [9]:
df_top_yout.head(10)

          Artist   Total Views  100M    Avg
0            BTS  2.794790e+12  63.0   7.37
1      Bad Bunny  2.757340e+12  66.0  14.55
2  Justin Bieber  2.739970e+12  37.0   3.99
3     Ed Sheeran  2.689400e+12  39.0   4.61
4   Taylor Swift  2.435000e+12  38.0   5.72
5        Shakira  2.396180e+12  43.0   7.84
6     Katy Perry  2.355340e+12  25.0   3.18
7          Ozuna  2.252480e+12  49.0   4.93
8         Eminem  2.093770e+12  38.0   5.84
9  Ariana Grande  2.061850e+12  37.0   3.37

In [10]:
df_top_yout.sort_values(by=['Artist'],ascending=False).head(100)

             Artist   Total Views           100M   Avg
1374         Łobuzy  3.965000e+10            2.0  0.11
537     İrem Derici  1.717300e+11            3.0  0.32
634      Ñengo Flow  1.388800e+11            4.0  0.82
1032  Çağatay Akman  7.427000e+10            2.0  0.05
350       will.i.am  2.582000e+11            6.0  0.29
...             ...           ...            ...   ...
516      Via Vallen  1.787500e+11            3.0  0.08
1507   Veysel Mutlu  2.774000e+10            1.0  0.03
1358         Veysel  4.122000e+10  Não Informado  0.06
891       Vengaboys  9.348000e+10            3.0  0.34
864       Vegedream  9.913000e+10            1.0  0.51

[100 rows x 4 columns]

In [11]:
df_top_yout.to_csv(r".\topyoutube_t.csv", index=False)